<details><summary>Digger run report at 2023-07-31 12:06:29 (UTC)</summary>
    <details><summary>Plan for <b>nhamcloudlab/digger_demo_multienv#prod</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_iam_role.test_role3 will be created
  + resource "aws_iam_role" "test_role3" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "test_role3"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "tag-key" = "tag-value"
        }
      + tags_all              = {
          + "tag-key" = "tag-value"
        }
      + unique_id             = (known after apply)
    }

  # null_resource.test_prod will be created
  + resource "null_resource" "test_prod" {
      + id = (known after apply)
    }

  # null_resource.test_prod2223 will be created
  + resource "null_resource" "test_prod2223" {
      + id = (known after apply)
    }

  # null_resource.test_prod22234 will be created
  + resource "null_resource" "test_prod22234" {
      + id = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
  ```
</details>

<details><summary>Terraform plan validation check (prod)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>